QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_pie.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the PIEIER9 register
//
//*************************************************************************************************
#define PIE_IER9_INTX1  0x1U    // Enable for Interrupt 9.1
#define PIE_IER9_INTX2  0x2U    // Enable for Interrupt 9.2
#define PIE_IER9_INTX3  0x4U    // Enable for Interrupt 9.3
#define PIE_IER9_INTX4  0x8U    // Enable for Interrupt 9.4
#define PIE_IER9_INTX5  0x10U   // Enable for Interrupt 9.5
#define PIE_IER9_INTX6  0x20U   // Enable for Interrupt 9.6
#define PIE_IER9_INTX7  0x40U   // Enable for Interrupt 9.7
#define PIE_IER9_INTX8  0x80U   // Enable for Interrupt 9.8
#define PIE_IER9_INTX9  0x100U  // Enable for Interrupt 9.9
#define PIE_IER9_INTX10 0x200U  // Enable for Interrupt 9.10
#define PIE_IER9_INTX11 0x400U  // Enable for Interrupt 9.11
#define PIE_IER9_INTX12 0x800U  // Enable for Interrupt 9.12
#define PIE_IER9_INTX13 0x1000U // Enable for Interrupt 9.13
#define PIE_IER9_INTX14 0x2000U // Enable for Interrupt 9.14
#define PIE_IER9_INTX15 0x4000U // Enable for Interrupt 9.15
#define PIE_IER9_INTX16 0x8000U // Enable for Interrupt 9.16

//*************************************************************************************************
//
// The following are defines for the bit fields in the PIEIFR9 register
//
//*************************************************************************************************
#define PIE_IFR9_INTX1  0x1U    // Flag for Interrupt 9.1
#define PIE_IFR9_INTX2  0x2U    // Flag for Interrupt 9.2
#define PIE_IFR9_INTX3  0x4U    // Flag for Interrupt 9.3
#define PIE_IFR9_INTX4  0x8U    // Flag for Interrupt 9.4
#define PIE_IFR9_INTX5  0x10U   // Flag for Interrupt 9.5
#define PIE_IFR9_INTX6  0x20U   // Flag for Interrupt 9.6
#define PIE_IFR9_INTX7  0x40U   // Flag for Interrupt 9.7
#define PIE_IFR9_INTX8  0x80U   // Flag for Interrupt 9.8
#define PIE_IFR9_INTX9  0x100U  // Flag for Interrupt 9.9
#define PIE_IFR9_INTX10 0x200U  // Flag for Interrupt 9.10
#define PIE_IFR9_INTX11 0x400U  // Flag for Interrupt 9.11
#define PIE_IFR9_INTX12 0x800U  // Flag for Interrupt 9.12
#define PIE_IFR9_INTX13 0x1000U // Flag for Interrupt 9.13
#define PIE_IFR9_INTX14 0x2000U // Flag for Interrupt 9.14
#define PIE_IFR9_INTX15 0x4000U // Flag for Interrupt 9.15
#define PIE_IFR9_INTX16 0x8000U // Flag for Interrupt 9.16

//*************************************************************************************************
//
// The following are defines for the bit fields in the PIEIER10 register
//
//*************************************************************************************************
#define PIE_IER10_INTX1  0x1U    // Enable for Interrupt 10.1
#define PIE_IER10_INTX2  0x2U    // Enable for Interrupt 10.2
#define PIE_IER10_INTX3  0x4U    // Enable for Interrupt 10.3
#define PIE_IER10_INTX4  0x8U    // Enable for Interrupt 10.4
#define PIE_IER10_INTX5  0x10U   // Enable for Interrupt 10.5
#define PIE_IER10_INTX6  0x20U   // Enable for Interrupt 10.6
#define PIE_IER10_INTX7  0x40U   // Enable for Interrupt 10.7
#define PIE_IER10_INTX8  0x80U   // Enable for Interrupt 10.8
#define PIE_IER10_INTX9  0x100U  // Enable for Interrupt 10.9
#define PIE_IER10_INTX10 0x200U  // Enable for Interrupt 10.10
#define PIE_IER10_INTX11 0x400U  // Enable for Interrupt 10.11
#define PIE_IER10_INTX12 0x800U  // Enable for Interrupt 10.12
#define PIE_IER10_INTX13 0x1000U // Enable for Interrupt 10.13
#define PIE_IER10_INTX14 0x2000U // Enable for Interrupt 10.14
#define PIE_IER10_INTX15 0x4000U // Enable for Interrupt 10.15
#define PIE_IER10_INTX16 0x8000U // Enable for Interrupt 10.16

//*************************************************************************************************
//
// The following are defines for the bit fields in the PIEIFR10 register
//
//*************************************************************************************************
#define PIE_IFR10_INTX1  0x1U    // Flag for Interrupt 10.1
#define PIE_IFR10_INTX2  0x2U    // Flag for Interrupt 10.2
#define PIE_IFR10_INTX3  0x4U    // Flag for Interrupt 10.3
#define PIE_IFR10_INTX4  0x8U    // Flag for Interrupt 10.4
#define PIE_IFR10_INTX5  0x10U   // Flag for Interrupt 10.5
#define PIE_IFR10_INTX6  0x20U   // Flag for Interrupt 10.6
#define PIE_IFR10_INTX7  0x40U   // Flag for Interrupt 10.7
#define PIE_IFR10_INTX8  0x80U   // Flag for Interrupt 10.8
#define PIE_IFR10_INTX9  0x100U  // Flag for Interrupt 10.9
#define PIE_IFR10_INTX10 0x200U  // Flag for Interrupt 10.10
#define PIE_IFR10_INTX11 0x400U  // Flag for Interrupt 10.11
#define PIE_IFR10_INTX12 0x800U  // Flag for Interrupt 10.12
#define PIE_IFR10_INTX13 0x1000U // Flag for Interrupt 10.13
#define PIE_IFR10_INTX14 0x2000U // Flag for Interrupt 10.14
#define PIE_IFR10_INTX15 0x4000U // Flag for Interrupt 10.15
#define PIE_IFR10_INTX16 0x8000U // Flag for Interrupt 10.16

//*************************************************************************************************
//
// The following are defines for the bit fields in the PIEIER11 register
//
//*************************************************************************************************
#define PIE_IER11_INTX1  0x1U    // Enable for Interrupt 11.1
#define PIE_IER11_INTX2  0x2U    // Enable for Interrupt 11.2
#define PIE_IER11_INTX3  0x4U    // Enable for Interrupt 11.3
#define PIE_IER11_INTX4  0x8U    // Enable for Interrupt 11.4
#define PIE_IER11_INTX5  0x10U   // Enable for Interrupt 11.5
#define PIE_IER11_INTX6  0x20U   // Enable for Interrupt 11.6
#define PIE_IER11_INTX7  0x40U   // Enable for Interrupt 11.7
#define PIE_IER11_INTX8  0x80U   // Enable for Interrupt 11.8
#define PIE_IER11_INTX9  0x100U  // Enable for Interrupt 11.9
#define PIE_IER11_INTX10 0x200U  // Enable for Interrupt 11.10
#define PIE_IER11_INTX11 0x400U  // Enable for Interrupt 11.11
#define PIE_IER11_INTX12 0x800U  // Enable for Interrupt 11.12
#define PIE_IER11_INTX13 0x1000U // Enable for Interrupt 11.13
#define PIE_IER11_INTX14 0x2000U // Enable for Interrupt 11.14
#define PIE_IER11_INTX15 0x4000U // Enable for Interrupt 11.15
#define PIE_IER11_INTX16 0x8000U // Enable for Interrupt 11.16

//*************************************************************************************************
//
// The following are defines for the bit fields in the PIEIFR11 register
//
//*************************************************************************************************
#define PIE_IFR11_INTX1  0x1U    // Flag for Interrupt 11.1
#define PIE_IFR11_INTX2  0x2U    // Flag for Interrupt 11.2
#define PIE_IFR11_INTX3  0x4U    // Flag for Interrupt 11.3
#define PIE_IFR11_INTX4  0x8U    // Flag for Interrupt 11.4
#define PIE_IFR11_INTX5  0x10U   // Flag for Interrupt 11.5
#define PIE_IFR11_INTX6  0x20U   // Flag for Interrupt 11.6
#define PIE_IFR11_INTX7  0x40U   // Flag for Interrupt 11.7
#define PIE_IFR11_INTX8  0x80U   // Flag for Interrupt 11.8
#define PIE_IFR11_INTX9  0x100U  // Flag for Interrupt 11.9
#define PIE_IFR11_INTX10 0x200U  // Flag for Interrupt 11.10
#define PIE_IFR11_INTX11 0x400U  // Flag for Interrupt 11.11
#define PIE_IFR11_INTX12 0x800U  // Flag for Interrupt 11.12
#define PIE_IFR11_INTX13 0x1000U // Flag for Interrupt 11.13
#define PIE_IFR11_INTX14 0x2000U // Flag for Interrupt 11.14
#define PIE_IFR11_INTX15 0x4000U // Flag for Interrupt 11.15
#define PIE_IFR11_INTX16 0x8000U // Flag for Interrupt 11.16

//*************************************************************************************************
//
// The following are defines for the bit fields in the PIEIER12 register
//
//*************************************************************************************************
#define PIE_IER12_INTX1  0x1U    // Enable for Interrupt 12.1
#define PIE_IER12_INTX2  0x2U    // Enable for Interrupt 12.2
#define PIE_IER12_INTX3  0x4U    // Enable for Interrupt 12.3
#define PIE_IER12_INTX4  0x8U    // Enable for Interrupt 12.4
#define PIE_IER12_INTX5  0x10U   // Enable for Interrupt 12.5
#define PIE_IER12_INTX6  0x20U   // Enable for Interrupt 12.6
#define PIE_IER12_INTX7  0x40U   // Enable for Interrupt 12.7
#define PIE_IER12_INTX8  0x80U   // Enable for Interrupt 12.8
#define PIE_IER12_INTX9  0x100U  // Enable for Interrupt 12.9
#define PIE_IER12_INTX10 0x200U  // Enable for Interrupt 12.10
#define PIE_IER12_INTX11 0x400U  // Enable for Interrupt 12.11
#define PIE_IER12_INTX12 0x800U  // Enable for Interrupt 12.12
#define PIE_IER12_INTX13 0x1000U // Enable for Interrupt 12.13
#define PIE_IER12_INTX14 0x2000U // Enable for Interrupt 12.14
#define PIE_IER12_INTX15 0x4000U // Enable for Interrupt 12.15
#define PIE_IER12_INTX16 0x8000U // Enable for Interrupt 12.16

//*************************************************************************************************
//
// The following are defines for the bit fields in the PIEIFR12 register
//
//*************************************************************************************************
#define PIE_IFR12_INTX1  0x1U    // Flag for Interrupt 12.1
#define PIE_IFR12_INTX2  0x2U    // Flag for Interrupt 12.2
#define PIE_IFR12_INTX3  0x4U    // Flag for Interrupt 12.3
#define PIE_IFR12_INTX4  0x8U    // Flag for Interrupt 12.4
#define PIE_IFR12_INTX5  0x10U   // Flag for Interrupt 12.5
#define PIE_IFR12_INTX6  0x20U   // Flag for Interrupt 12.6
#define PIE_IFR12_INTX7  0x40U   // Flag for Interrupt 12.7
#define PIE_IFR12_INTX8  0x80U   // Flag for Interrupt 12.8
#define PIE_IFR12_INTX9  0x100U  // Flag for Interrupt 12.9
#define PIE_IFR12_INTX10 0x200U  // Flag for Interrupt 12.10
#define PIE_IFR12_INTX11 0x400U  // Flag for Interrupt 12.11
#define PIE_IFR12_INTX12 0x800U  // Flag for Interrupt 12.12
#define PIE_IFR12_INTX13 0x1000U // Flag for Interrupt 12.13
#define PIE_IFR12_INTX14 0x2000U // Flag for Interrupt 12.14
#define PIE_IFR12_INTX15 0x4000U // Flag for Interrupt 12.15
#define PIE_IFR12_INTX16 0x8000U // Flag for Interrupt 12.16

#endif
